results/dotnet.json.100.log
Running 10s test @ http://localhost:5002/test/long_response/100
  6 threads and 6 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.86ms  434.77us  11.41ms   95.66%
    Req/Sec     1.20k   102.76     1.33k    79.67%
  71857 requests in 10.00s, 31.45MB read
Requests/sec:   7182.98
Transfer/sec:      3.14MB