results/dotnet.json.1000.log
Running 10s test @ http://localhost:5002/test/long_response/1000
  6 threads and 6 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.87ms    6.42ms  32.15ms   78.45%
    Req/Sec   180.99     57.28   424.00     67.50%
  10870 requests in 10.05s, 42.08MB read
Requests/sec:   1081.08
Transfer/sec:      4.18MB