results/golang.grpc.1.log

Summary:
  Count:	250348
  Total:	10.00 s
  Slowest:	11.16 ms
  Fastest:	0.47 ms
  Average:	1.66 ms
  Requests/sec:	25034.88

Response time histogram:
  0.467  [1]      |
  1.536  [141550] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  2.605  [86039]  |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  3.675  [17475]  |∎∎∎∎∎
  4.744  [4468]   |∎
  5.813  [634]    |
  6.883  [81]     |
  7.952  [12]     |
  9.021  [1]      |
  10.091 [19]     |
  11.160 [20]     |

Latency distribution:
  10 % in 1.08 ms 
  25 % in 1.25 ms 
  50 % in 1.47 ms 
  75 % in 1.82 ms 
  90 % in 2.52 ms 
  95 % in 3.12 ms 
  99 % in 4.07 ms 

Status code distribution:
  [OK]            250300 responses   
  [Canceled]      22 responses       
  [Unavailable]   26 responses       

Error distribution:
  [22]   rpc error: code = Canceled desc = grpc: the client connection is closing                                                                     
  [3]    rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:51280->127.0.0.1:6001: use of closed network connection   
  [6]    rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:51281->127.0.0.1:6001: use of closed network connection   
  [7]    rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:51283->127.0.0.1:6001: use of closed network connection   
  [5]    rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:51279->127.0.0.1:6001: use of closed network connection   
  [2]    rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:51278->127.0.0.1:6001: use of closed network connection   
  [3]    rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:51282->127.0.0.1:6001: use of closed network connection