results/golang.grpc.stream.1000.log

Summary:
  Count:	11396
  Total:	10.00 s
  Slowest:	150.97 ms
  Fastest:	10.68 ms
  Average:	43.75 ms
  Requests/sec:	1139.56

Response time histogram:
  10.681  [1]    |
  24.710  [2035] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  38.739  [3606] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  52.768  [2742] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  66.798  [1506] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  80.827  [754]  |∎∎∎∎∎∎∎∎
  94.856  [406]  |∎∎∎∎∎
  108.885 [231]  |∎∎∎
  122.914 [48]   |∎
  136.943 [14]   |
  150.972 [3]    |

Latency distribution:
  10 % in 22.48 ms 
  25 % in 28.34 ms 
  50 % in 38.87 ms 
  75 % in 54.03 ms 
  90 % in 72.84 ms 
  95 % in 84.38 ms 
  99 % in 103.86 ms 

Status code distribution:
  [OK]            11346 responses   
  [Canceled]      40 responses      
  [Unavailable]   10 responses      

Error distribution:
  [40]   rpc error: code = Canceled desc = grpc: the client connection is closing                                                                     
  [2]    rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:51364->127.0.0.1:6001: use of closed network connection   
  [2]    rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:51362->127.0.0.1:6001: use of closed network connection   
  [6]    rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:51360->127.0.0.1:6001: use of closed network connection